def can_eat(a, b):
    # a - координаты коня
    # b - координаты другой фигуры
    # Если разности первых координат двух фигур = 1 и разность вторых координат двух фигур = 2, то выводим True:
    if (abs(a[0] - b[0]) == 1 and abs(a[1] - b[1]) == 2):
        return (True)
    # Если разности вторых координат двух фигур = 1 и разность первых координат двух фигур = 2, то выводим True:
    elif (abs(a[1] - b[1]) == 1 and abs(a[0] - b[0]) == 2):
        return (True)
    # Иначе вывдим False:
    return (False)
result = can_eat([2, 1],[4, 2])
print(result)